["Hiring Team Lila Sciences www.lila.ai Dear Hiring Team, I’m writing to express my enthusiastic interest in the Machine Learning Engineer position at Lila Sciences. With a Master’s degree in Computer Science and a strong focus on large language models, NLP, and applied AI systems, I’m excited by Lila’s mission to bring scientific superintelligence to life. Over the past year, I’ve built and deployed several projects using state-of-the-art generative AI techniques. These include: •", "generative AI techniques. These include: • Retrieval-Augmented Generation System (GitHub) — integrates vector databases and local LLMs to enable question-answering over custom PDF documents. • Text-to-SQL Translator (GitHub) — turns natural language into SQL queries using prompt engineering and schema parsing. • Drive-Thru Voice Assistant (GitHub) — combines speech recognition, LLaMA 3-based order parsing, and gTTS for voice-based interaction, backed by a persistent memory store. These projects", "by a persistent memory store. These projects reflect not only my engineering capability but also a deep understanding of transformer architectures, encoder-decoder mechanisms, attention layers, and inference-time efficiency tradeoffs. I’m also familiar with domain adaptation, RAG pipelines, and evaluation strategies specific to generative and retrieval-based systems. I actively follow developments in the open-source LLM space (e.g., Ollama, Hugging Face Transformers, LoRA fine-tuning), and I’m", "Face Transformers, LoRA fine-tuning), and I’m comfortable working across Python, PyTorch, and cloud-based or on-prem distributed environments. My engineering mindset is complemented by a strong grasp of NLP fundamentals—tokenization, embeddings, attention, context windows, and prompt chaining—which I’ve used to build intelligent, task-specific agents. What excites me most about Lila Sciences is your vision of infusing the scientific method with autonomous, AI-driven discovery. I would love to", "autonomous, AI-driven discovery. I would love to contribute to this bold mission—helping accelerate breakthroughs across health, climate, and materials by scaling ML capabilities and building robust, production-ready systems. Thank you for considering my application. I would be honored to bring my skills and passion for NLP, LLMs, and transformative science to the team at Lila."]